Repository: BravoBaldo/Translations
Catalog: WaveShare/OmegaT_WaveShare/OmegaT_WaveShare-level1.tmx
Source language: en_us
Languages: it_it

source: The TMCL-IDE is available free of charge and runs on Windows 7, Windows 8.x, Windows 10 and Windows 11.
it_it: TMCL-IDE è disponibile gratuitamente e funziona su Windows 7, Windows 8.x, Windows 10 e Windows 11.

source: The TMCL-IDE uses hexadecimal and decimal numbers.
it_it: TMCL-IDE utilizza numeri esadecimali e decimali.

source: The TMCL-IDE will always automatically show the version of the Parameter Calculator that fits for the connected module.
it_it: L'interfaccia TMCL-IDE mostrerà sempre automaticamente la versione del "Parameter Calculator" adatta al modulo collegato.

source: The TMCL/PC Host
it_it: L'Host TMCL/PC

source: The TMCL/PC Host is a tool that can control one or more modules using a TMCL program that is being executed on the PC and not on the module.
it_it: L'Host TMCL/PC è uno strumento in grado di controllare uno o più moduli utilizzando un programma TMCL in esecuzione sul PC e non sul modulo.

source: The TMCL/PC Menu
it_it: Il Menù TMCL/PC

source: The TMCL/PC host is not to be confused with the TMCL Creator.
it_it: L'host TMCL/PC non deve essere confuso con TMCL Creator.

source: The TMCL/PC interpreter also has a local accumulator register, a local X register and local TMCL flags.
it_it: L'interprete TMCL/PC dispone anche di un registro accumulatore locale, un registro X locale e flag TMCL locali.

source: The TMCL/PC interpreter provides an array of local variables for storing values locally.
it_it: L'interprete TMCL/PC fornisce un array di variabili locali per la memorizzazione locale dei valori.

source: The Target User knows how to responsibly make use of this product without causing harm to himself or others, and without causing damage to systems or devices, in which the user incorporates the product.
it_it: Il "Target User" sa come utilizzare questo prodotto in modo responsabile senza causare danni a sé stesso o ad altri e senza causare danni ai sistemi o ai dispositivi in ​​cui l'utente integra il prodotto.

source: The Thresholds Tab
it_it: Il Tab Thresholds

source: The Torque Graph
it_it: Il Torque Graph

source: The Torque Graph is a tool for graphically displaying axis parameters.
it_it: Il Torque Graph è un tool per la visualizzazione grafica dei parametri degli assi.

source: The Torque Graph is only available with modules that support a torque mode (BLDC modules and closed loop stepper motor modules).
it_it: Il Torque Graph è disponibile solo con i moduli che supportano la modalità di coppia (moduli BLDC e moduli motore passo-passo ad anello chiuso).

source: The Torque Graph tool is the same tool as the TMCL Torque Graph.
it_it: Il tool Torque Graph è lo stesso tool del TMCL Torque Graph.

source: The Torque Mode (BLDC Motor)
it_it: Modalità Torque (Motore BLDC)

source: The Torque Mode (Stepper Motor)
it_it: Modalità he Torque (Stepper Motor)

source: The Trace tab shows all CANopen objects that are continuously read by the TMCL-IDE.
it_it: Il tab Trace mostra tutti gli oggetti CANopen letti continuamente da TMCL-IDE.

source: The User Variable Display
it_it: User Variable Display

source: The User Variable Display is a tool for displaying the contents of selected TMCL user variables with automatic periodic update.
it_it: Lo "User Variable Display" è un tool per visualizzare il contenuto di variabili utente TMCL selezionate con aggiornamento periodico automatico.

source: The Velocity Graph
it_it: Il Grafico della Velocità

source: The Velocity Graph is a tool for graphically displaying axis parameters, user variables and the states of input/output ports of the module.
it_it: Il Velocity Graph è un tool per la visualizzazione grafica dei parametri degli assi, delle variabili utente e degli stati delle porte di ingresso/uscita del modulo.

source: The Velocity Graph tool is the same tool as the TMCL Velocity Graph.
it_it: Il tool Velocity Graph è lo stesso tool TMCL Velocity Graph.

source: The Velocity Mode
it_it: Il Velocity Mode

source: The X/Y plotter plots up to four value pairs in an XY graph.
it_it: l plotter X/Y traccia fino a quattro coppie di valori in un grafico XY.

source: The about box gives an overview of the paths where components are installed.
it_it: La finestra "about" fornisce una panoramica dei path in cui sono installati i componenti.

source: The actual position in the program is shown and updated after every command, and the contents of the accumulator and the X register are also shown on the status bar and updated after every command.
it_it: La posizione effettiva nel programma viene visualizzata e aggiornata dopo ogni comando, e il contenuto dell'accumulatore e del registro X viene visualizzato anche sulla barra di stato e aggiornato dopo ogni comando.

source: The actual position is shown by a green arrow in the editor.
it_it: La posizione effettiva è indicata da una freccia verde nell'editor.

source: The actual velocity value shows the velocity that is currently being tested and so tells about the progress of the profile recording.
it_it: Il valore di velocità effettivo mostra la velocità attualmente in fase di test e quindi fornisce informazioni sull'avanzamento della registrazione del profilo.

source: The basic functions are the same in all versions of the position mode tool:
it_it: Le funzioni di base sono le stesse in tutte le versioni del tool position mode:

source: The blue line should be as far away from zero as possible when the motor is running normally.
it_it: La linea blu dovrebbe essere il più lontano possibile dallo zero quando il motore funziona normalmente.

source: The board management URL is used to index the development board information of a specified platform.
it_it: L'URL del board management viene utilizzato per indicizzare le informazioni sulla scheda di sviluppo di una piattaforma specifica.

source: The calculation commands that use variables and the DJNZ command work on the local variables in bank 0.
it_it: I comandi di calcolo che utilizzano variabili e il comando DJNZ funzionano sulle variabili locali nel banco 0.

source: The calculation takes place during compile time and not during runtime.
it_it: Il calcolo avviene durante la fase di compilazione e non durante l'esecuzione.

source: The central part of the TMCL Creator is its main window with its own menu bar and the TMCL program editor.
it_it: La parte centrale di TMCL Creator è la finestra principale con la propria barra dei menù e l'editor di programmi TMCL.

source: The check-boxes in the bottom section of the tab control the logging of the TMCL communication (which parts of the TMCL communication will be displayed in the TMCL Log window):
it_it: I check-boxe nella sezione inferiore della scheda controllano la registrazione della comunicazione TMCL (quali parti della comunicazione TMCL verranno visualizzate nella finestra Registro TMCL):

source: The checkbox in the DCF Use column shows if the DCF value of an object will be stored in the DCF file or will be sent to the device when configuring it.
it_it: La checkbox nella colonna DCF Use indica se il valore DCF di un oggetto verrà memorizzato nel file DCF o verrà inviato al dispositivo durante la configurazione.

source: The checkbox on the first tab switches the closed loop function of the module on and off.
it_it: La checkbox nella prima tab attiva e disattiva la funzione a ciclo chiuso del modulo.

source: The closed-loop tool is provided for each axis of a closed-loop stepper motor module.
it_it: Il Tool closed-loop è disponibile per ciascun asse di un modulo motore passo-passo ad anello chiuso.

source: The color of each PDO entry can also be individually selected.
it_it: È anche possibile selezionare individualmente il colore di ciascuna voce PDO.

source: The color of each line shows the standard deviation of the ten load values that have been measured for the velocity at that point.
it_it: Il colore di ogni linea indica la deviazione standard dei dieci valori di carico misurati per la velocità in quel punto.

source: The command mnemonics given there are used in the TMCL Creator.
it_it: I comandi mnemonici ivi forniti vengono utilizzati in TMCL Creator.

source: The compilation process is as follows:
it_it: Il processo di compilazione è il seguente:

source: The contents of local variables can also be displayed for debugging purposes using the Local Variables Window.
it_it: Il contenuto delle variabili locali può anche essere visualizzato a scopo di debug utilizzando la finestra Local Variables.

source: The contents of the accumulator and the X register are also shown on the status bar while the program is paused.
it_it: Il contenuto dell'accumulatore e del registro X viene visualizzato anche sulla barra di stato mentre il programma è in pausa.

source: The contents of the accumulator and the X register are also shown on the status bar.
it_it: Il contenuto dell'accumulatore e del registro X viene visualizzato anche sulla barra di stato.

source: The contents of the accumulator and the X register are shown on the status bar of the TMCL Creator window.
it_it: Il contenuto dell'accumulatore e del registro X è visualizzato sulla barra di stato della finestra di TMCL Creator.

source: The contents of the displayed axis parameters can be presented in decimal or in hexadecimal form.
it_it: Il contenuto dei parametri degli assi visualizzati può essere presentato in formato decimale o esadecimale.

source: The contents of the displayed parameters can be presented in decimal or in hexadecimal form.
it_it: Il contenuto dei parametri visualizzati può essere visualizzato in formato decimale o esadecimale.

source: The contents of the displayed user variables can be presented in decimal or in hexadecimal form.
it_it: Il contenuto delle variabili utente visualizzate può essere presentato in formato decimale o esadecimale.

source: The contents of the local accumulator and the local X register are displayed on the status line at the bottom of the main window.
it_it: Il contenuto dell'accumulatore locale e del registro X locale viene visualizzato sulla riga di stato nella parte inferiore della finestra principale.

source: The context menu offers some options for changing the appearance of the graph and for selecting the items that are to be displayed:
it_it: Il menu contestuale offre alcune opzioni per modificare l'aspetto del grafico e per selezionare gli elementi da visualizzare:

source: The corresponding COM ports are shown here, click to modify them
it_it: Le porte COM corrispondenti sono mostrate qui, cliccare per modificarle.

source: The corresponding parameter numbers are shown when hovering over a setting with the mouse pointer.
it_it: I numeri dei parametri corrispondenti vengono visualizzati passando il mouse sopra un'impostazione.

source: The current demo provides test firmware, which can be used to test whether the onboard device functions properly by directly flashing the test firmware
it_it: La demo corrente fornisce un firmware di prova, utilizzabile per verificare il corretto funzionamento del dispositivo integrato, flashando direttamente il firmware di prova.

source: The current example has already been set up, so there is no need to do the following operation:
it_it: L'esempio corrente è già stato configurato, quindi non è necessario eseguire la seguente operazione:

source: The current state and status word display will be updated automatically afterwards.
it_it: Lo stato corrente e la visualizzazione della word di stato verranno aggiornati automaticamente in seguito.

source: The currently selected object in the list of mapped objects can be moved up or down using these two buttons.
it_it: L'oggetto attualmente selezionato nell'elenco degli oggetti mappati può essere spostato verso l'alto o verso il basso utilizzando questi due pulsanti.

source: The data below are OLED initialization commands (use the right mouse button to paste the data, keyboard shortcuts cannot be used):
it_it: I dati sottostanti sono comandi di inizializzazione OLED (utilizzare il tasto destro del mouse per incollare i dati, non è possibile utilizzare le scorciatoie da tastiera):

source: The data specified in this user manual is intended solely for the purpose of product description.
it_it: I dati specificati nel presente manuale utente sono destinati esclusivamente alla descrizione del prodotto.

source: The data will be shown as a decimal value in the left display field and as a hexadecimal value in the right display field.
it_it: I dati verranno visualizzati come valore decimale nel campo di visualizzazione a sinistra e come valore esadecimale nel campo di visualizzazione a destra.

source: The data will be updated as fast as set up in the timer setting of the module connection.
it_it: I dati verranno aggiornati alla velocità impostata nelle impostazioni del timer della connessione del modulo.

source: The debugger then first checks if the program has been modified and in this case the program will automatically be assembled and downloaded again to be sure that the program in the editor is the same as the program stored on the module.
it_it: Il debugger verifica innanzitutto se il programma è stato modificato e, in tal caso, il programma verrà automaticamente assemblato e scaricato nuovamente per verificare che il programma nell'editor corrisponda a quello memorizzato nel modulo.

source: The debugging command "halt" has already been used in the program download to pause the running program.
it_it: Il comando di debug "halt" è già stato utilizzato durante il download del programma per mettere in pausa il programma in esecuzione.

source: The default value is 500ms.
it_it: Il valore di default è 500 ms.

source: The delay entered in the LSS activate bitrate delay setting will be used.
it_it: Verrà utilizzato il ritardo immesso nell'impostazione del ritardo di attivazione del bitrate LSS.

source: The desired motor current can be entered, and the actual motor current is also shown.
it_it: È possibile immettere la corrente desiderata del motore e viene visualizzata anche la corrente effettiva del motore.

source: The development board has an onboard automatic download circuit, the Type C port at the UART silk screen is used for program download and log printing.
it_it: La scheda di sviluppo è dotata di un circuito di download automatico integrato; la porta Tipo C sulla serigrafia UART viene utilizzata per il download del programma e la stampa del log.

source: The development board uses PH2.0 header to lead out ADC, CAN, I2C, RS485 peripheral pins, and connects sensor components using PH2.0 to 2.54mm male connector
it_it: La scheda di sviluppo utilizza un connettore PH2.0 per collegare i pin delle periferiche ADC, CAN, I2C e RS485 e collega i componenti del sensore tramite un connettore maschio da 2,54 mm.

source: The development board uses USB to download the demo.
it_it: La scheda di sviluppo utilizza la porta USB per scaricare la demo.

source: The devices identified by different modes:
it_it: I dispositivi sono identificati da diverse modalità:

source: The different versions of the position mode all have the same basic functions.
it_it: Le diverse versioni della "position mode" hanno tutte le stesse funzioni di base.

source: The different versions of the velocity mode all have the same basic functions.
it_it: Le diverse versioni della modalità Velocità hanno tutte le stesse funzioni di base.

source: The different versions of the velocity mode tool always provide the same buttons for moving the motor:
it_it: Le diverse versioni dello strumento Modalità Velocità forniscono sempre gli stessi pulsanti per muovere il motore:

source: The display will be updated each time such a PDO has been sent out by the device and reaches the PDO Receiver tool.
it_it: La visualizzazione verrà aggiornata ogni volta che un PDO di questo tipo viene inviato dal dispositivo e raggiunge il tool PDO Receiver.

source: The display will be updated whenever a TMCL/PC local variable gets changed during execution of a TMCL/PC program.
it_it: La visualizzazione verrà aggiornata ogni volta che una variabile locale TMCL/PC viene modificata durante l'esecuzione di un programma TMCL/PC.

source: The displayed axis parameter values are updated periodically, as fast as set up in the timer settings of the module connection.
it_it: I valori dei parametri degli assi visualizzati vengono aggiornati periodicamente, con la velocità impostata nelle impostazioni del timer della connessione del modulo.

source: The displayed parameters are updated periodically, as fast as set up in the timer settings of the module connection.
it_it: I parametri visualizzati vengono aggiornati periodicamente, con la stessa velocità impostata nelle impostazioni del timer della connessione del modulo.

source: The displayed user variable contents are updated periodically, as fast as set up in the timer settings of the module connection.
it_it: Il contenuto delle variabili utente visualizzate viene aggiornato periodicamente, con la velocità impostata nelle impostazioni del timer della connessione del modulo.

source: The documentation provided here, is for programmers and engineers only, who are equipped with the necessary skills and have been trained to work with this type of product.
it_it: La documentazione qui fornita è destinata esclusivamente a programmatori e ingegneri dotati delle competenze necessarie e formati per lavorare con questo tipo di prodotto.

source: The download progress is shown in a special dialog.
it_it: L'avanzamento del download viene visualizzato in una finestra di dialogo speciale.

source: The easiest way to do this is to purge the modem manager using sudo apt-get purge modem manager.
it_it: Il modo più semplice per farlo è ripulire il gestore del modem usando sudo apt-get purge modem manager.

source: The effect is shown below:
it_it: L'effetto è mostrato di seguito:

source: The effects as shown below:
it_it: Gli effetti sono mostrati di seguito:

source: The environment setup is carried out on the Windows 10 system, Linux and Mac users can access Arduino-esp32 environment setup for reference
it_it: La configurazione dell'ambiente viene eseguita sul sistema Windows 10; gli utenti Linux e Mac possono accedere a Configurazione dell'ambiente Arduino-esp32 come riferimento.

source: The environment setup is carried out on the Windows 10 system, Linux and Mac users can access ESP-IDF environment setup for reference
it_it: La configurazione dell'ambiente viene eseguita sul sistema Windows 10; gli utenti Linux e Mac possono accedere a Configurazione dell'ambiente ESP-IDF come riferimento.

source: The error message will be displayed in the assembler progress dialog.
it_it: Il messaggio di errore verrà visualizzato nella finestra di dialogo di avanzamento dell'assembler.

source: The factory default setting is 2.
it_it: L'impostazione predefinita di fabbrica è 2.

source: The factory default setting on most TRINAMIC modules is 1000kBit/s.
it_it: L'impostazione di default di fabbrica sulla maggior parte dei moduli TRINAMIC è 1000 kBit/s.

source: The factory default setting on most Trinamic modules is 1000kBit/s.
it_it: L'impostazione di default di fabbrica sulla maggior parte dei moduli TRINAMIC è 1000 kBit/s.

source: The factory default value on most TRINAMIC modules is 9600bps, so this value is always good for a new module.
it_it: Il valore di default di fabbrica sulla maggior parte dei moduli TRINAMIC è 9600 bps, quindi questo valore è sempre valido per un nuovo modulo.

source: The features that are to be activated can be chosen on the High Speed tab.
it_it: Le funzioni da attivare possono essere selezionate nel tab High Speed.

source: The first byte (separated from the rest by a colon) typically is the register address.
it_it: Il primo byte (separato dal resto da due punti) è in genere l'indirizzo del registro.

source: The flags tool shows the states of all status flags and the states of all error flags that are provided by the connected module.
it_it: Il tool Flags mostra lo stato di tutti i flag di stato e quello di tutti i flag di errore forniti dal modulo collegato.

source: The flags view tool offers the following options:
it_it: Il tool di visualizzazione dei flag offre le seguenti opzioni:

source: The following NMT commands are available:
it_it: Sono disponibili i seguenti comandi NMT:

source: The following TMCL commands are executed locally and and work with the contents of the local accumulator register or local X register or local TMCL flags:
it_it: I seguenti comandi TMCL vengono eseguiti localmente e funzionano con il contenuto del registro accumulatore locale, del registro X locale o dei flag TMCL locali:

source: The following functions are provided:
it_it: Sono disponibili le seguenti funzioni:

source: The following is a demonstration of flashing a demo into the STM32F429IGT6 development board using the product's JTAG interface.
it_it: Di seguito è riportata una dimostrazione del flashing di una demo sulla scheda di sviluppo STM32F429IGT6 utilizzando l'interfaccia JTAG del prodotto.

source: The following is a demonstration of self-sending and receiving using the product's two serial ports.
it_it: Di seguito è riportata una dimostrazione dell'autoinvio e ricezione tramite le due porte seriali del prodotto.

source: The following is a demonstration of using the I2C function of the product to turn on and off the data output of TF-Luna in I2C mode (TF-Luna-related information).
it_it: Di seguito è riportata una dimostrazione dell'utilizzo della funzione I2C del prodotto per attivare e disattivare l'uscita dati di TF-Luna in modalità I2C (informazioni relative a TF-Luna).

source: The following is a demonstration of using the SPI function of the product to light up the OLED in SPI mode (OLED-related information) Download the SPI debugging software (USB TO UART_I2C_SPI_JTAG Software demo), no need to install, and directly open the use.
it_it: Di seguito è riportata una dimostrazione dell'utilizzo della funzione SPI del prodotto per accendere l'OLED in modalità SPI (Informazioni relative all'OLED). Scaricare il software di debug SPI (Demo software USB TO UART_I2C_SPI_JTAG), non è necessario installarlo, e aprirlo direttamente.

source: The following is a demonstration of using the product's SPI function to turn on an OLED in SPI mode (OLED-related information) (sample demo)
it_it: Di seguito è riportata una dimostrazione dell'utilizzo della funzione SPI del prodotto per accendere un OLED in modalità SPI (informazioni relative all'OLED) (demo di esempio)

source: The following is a demonstration of using the product's two serial ports for self-sending and receiving, please switch the mode to mode 0 (for two tty* devices).
it_it: Di seguito è riportata una dimostrazione dell'utilizzo delle due porte seriali del prodotto per l'auto-invio e ricezione; impostare la modalità su 0 (per due dispositivi tty*).

source: The following is a sample demo that demonstrates how to acquire data (TF-Luna-related information and pinout) from the TF-Luna in I2C mode using the product's I2C function.
it_it: Di seguito è riportato un esempio che mostra come acquisire dati (informazioni relative a TF-Luna e la piedinatura) da TF-Luna in modalità I2C utilizzando la funzione I2C del prodotto.

source: The following is an example of installing ESP32-3.0.2, if you install other boards or version numbers, the operation steps are similar.
it_it: Di seguito è riportato un esempio di installazione di ESP32-3.0.2. Se si installano altre schede o numeri di versione, i passaggi sono simili.

source: The following is using two serial ports of the product to perform self-transmission and reception.
it_it: Di seguito vengono illustrate le due porte seriali del prodotto utilizzate per eseguire l'autotrasmissione e la ricezione.
